documentation/manual/src/doc/design.md
~~~ mermaid
graph BT
  algebra.Endpoints
  play.server.Endpoints --> algebra.Endpoints
  akkahttp.client.Endpoints --> algebra.Endpoints
  openapi.Endpoints --> algebra.Endpoints
~~~
