documentation/manual/src/doc/design.md
~~~ mermaid
graph BT
  algebra.Endpoints
  algebra.JsonEntitiesFromSchemas --> algebra.Endpoints
  algebra.BasicAuthentication --> algebra.Endpoints
~~~
