documentation/manual/src/main/graphviz/extensible-algebra.gv
digraph {
  rankdir = BT
  node [shape=box,fontname=mono]
  edge [arrowhead=onormal]

  algebra [ label="algebra.Endpoints" ]
  json [ label="algebra.JsonEntitiesFromSchemas" ]
  auth [ label="algebra.BasicAuthentication" ]

  json -> algebra
  auth -> algebra
}
